БИТУправление_медицинским_центром_демо/src/Reports/ДоступностьИсследованийВнешнихЛабораторий/ДоступностьИсследованийВнешнихЛабораторий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ДоступностьИсследованийВнешнихЛабораторий</name>
</mdclass:Report>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/НоменклатураАнализов/НоменклатураАнализов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НоменклатураАнализов</name>
  <resources>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Исключен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Helix_MultiplePositions</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Helix_MultipleRules</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Лаборатория</name>
    <type>
      <types>CatalogRef.Лаборатории</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/ПериодыНедоступностиАнализов/ПериодыНедоступностиАнализов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПериодыНедоступностиАнализов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Лаборатория</name>
    <type>
      <types>CatalogRef.Лаборатории</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>Полное наименование</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <comment>Вид номенклатуры</comment>
    <type>
      <types>EnumRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетПоХарактеристикам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БазоваяЕдиницаИзмерения</name>
    <comment>Базовая единица измерения</comment>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьЧас</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьМин</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаХраненияОстатков</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаТоваров</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланируетсяБезСотрудника</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланируетсяБезОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоДляПланирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияВыработки</name>
    <type>
      <types>CatalogRef.КатегорииВыработки</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Анализ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндивидуальныйШаблонОсмотра</name>
    <type>
      <types>CatalogRef.ШаблоныHTML</types>
    </type>
  </attributes>
  <attributes>
    <name>TRADENAME</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>LATNAME</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>REGNUM</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>REGDATE</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FIRM_REGISTRATOR</name>
    <comment>Организация-регистратор</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>COUNTRY_REGISTRATOR</name>
    <comment>Страна организации-регистратора</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>FIRM_MANUFACTOR</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>COUNTRY_MANUFACTOR</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>PHARMGROUP</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>URL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>STATUS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>NDV</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>REGCERTID</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>PHARMAACTIONS</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>STRONG</name>
    <type>
      <types>EnumRef.СильнодействующиеИЯды</types>
    </type>
  </attributes>
  <attributes>
    <name>JNVLS</name>
    <type>
      <types>EnumRef.СпискиЖНиВЛП</types>
    </type>
  </attributes>
  <attributes>
    <name>NARCO</name>
    <type>
      <types>EnumRef.СпискиНаркотическихВеществ</types>
    </type>
  </attributes>
  <attributes>
    <name>Архив</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьЕдиницыУслуги</name>
    <comment>Одна единица услуги имеет данную продолжительность</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураМедицинскихУслуг</name>
    <type>
      <types>CatalogRef.НоменклатураМедицинскихУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>удалитьСтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодготовкаКлиентаКСдачеАнализа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>DICOMModality</name>
    <type>
      <types>CatalogRef.DICOMModality</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСтавкиНДС</name>
    <type>
      <types>EnumRef.ВидыСтавокНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>МедосмотрСправка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЦенаМедосмотраИзДействийМедосмотра</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетПоСериям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КЛП</name>
    <comment>Код лекарства в ЕСКЛП РФ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>41</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АТХ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодМедУслуги</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодТРУ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НормализованнаяФорма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВредныйФакторСправки</name>
    <type>
      <types>CatalogRef.ПереченьВредныхФакторовИРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособФомированияЦеныМедосмотра</name>
    <type>
      <types>EnumRef.СпособФормированияЦеныМедосмотра</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентПринципал</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КомплектующиеНоменклатуры</name>
    <attributes>
      <name>Комплектующая</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаКомплектующей</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СопутствующиеТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Оборудования</name>
    <attributes>
      <name>Оборудование</name>
      <type>
        <types>CatalogRef.МоделиОборудования</types>
        <types>CatalogRef.Оборудование</types>
      </type>
    </attributes>
    <attributes>
      <name>Филиал</name>
      <type>
        <types>CatalogRef.Филиалы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОборудованиеDICOM</name>
    <attributes>
      <name>Оборудование</name>
      <type>
        <types>CatalogRef.Оборудование</types>
      </type>
    </attributes>
    <attributes>
      <name>Филиал</name>
      <type>
        <types>CatalogRef.Филиалы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/Reports/ДоступностьИсследованийВнешнихЛабораторий/ObjectModule.bsl
#Область РазделОписанияПеременных

Перем мНоменклатураАнализов Экспорт; // Заполняется, если требуется вывести даже номенклатуру, с которой сопоставление с лабораторией никогда не делалось.

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	ПараметрДата = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Дата"));
	
	Лаборатории = Неопределено;

	ПараметрЛаборатории = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Лаборатории"));
	Если ПараметрЛаборатории.Использование Тогда
		Если ТипЗнч(ПараметрЛаборатории.Значение) = Тип("СписокЗначений") Тогда
			Лаборатории = ПараметрЛаборатории.Значение.ВыгрузитьЗначения();
		ИначеЕсли ТипЗнч(ПараметрЛаборатории.Значение) = Тип("СправочникСсылка.Лаборатории") Тогда
			Лаборатории = Новый Массив;
			Лаборатории.Добавить(ПараметрЛаборатории.Значение);
		КонецЕсли;
	КонецЕсли;
	
	ДатаОтчета = ?(ТипЗнч(ПараметрДата.Значение) = Тип("СтандартнаяДатаНачала"), ПараметрДата.Значение.Дата, ПараметрДата.Значение);
	
	Таблица = ПолучитьДанныеОДоступностиИсследованийЛабораторий(ДатаОтчета, Лаборатории, мНоменклатураАнализов);
	ВнешниеНаборыДанных = Новый Структура("Данные", Таблица);
	
	ОсновнойМакетОформления = УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("ОсновнойМакетОформленияСКД");
	КомпоновщикНастроек.ЗагрузитьНастройки(КомпоновщикНастроек.ПолучитьНастройки());
	ПараметрМакет = КомпоновщикНастроек.Настройки.ПараметрыВывода.Элементы.Найти("МакетОформления");
	ПараметрМакет.Значение = ОсновнойМакетОформления;
	ПараметрМакет.Использование = Истина;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();    
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.ПолучитьНастройки(), ДанныеРасшифровки);
	
	// Инициализация процессора компоновки.
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	
	// Получение результата.
	ПроцессорВыводаРезультатаКомпоновкиДанных = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	
	ПроцессорВыводаРезультатаКомпоновкиДанных.УстановитьДокумент(ДокументРезультат);
	ПроцессорВыводаРезультатаКомпоновкиДанных.Вывести(ПроцессорКомпоновкиДанных);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает данные о доступности номенклатуры исследований внешних лабораторий.
//
// Параметры:
//  Дата					 - Дата - используется для проверки доступности исследований на определенную дату.
//  Лаборатории				 - Массив Из СправочникСсылка.Лаборатории - лаборатории, для которых проверяется доступность исследований.
//  						 - Неопределено - если не выполняется отбор по лабораториям.
//  НоменклатураИсследований - Массив Из СправочникСсылка.Номенклатура - проверяемая номенклатура исследований.
//  						 - Неопределено - если не выполняется отбор по номенклатуре исследований.
// 
// Возвращаемое значение:
//   ТаблицаЗначений
//   	* Лаборатория 	- СправочникСсылка.Лаборатории
//   	* Исследование 	- СправочникСсылка.Номенклатура
//   	* Идентификатор - Строка - идентификатор исследования/анализа.
//   	* Доступно 		- Булево - если Истина, тогда исследование доступно для лаборатории. 
//
Функция ПолучитьДанныеОДоступностиИсследованийЛабораторий(Дата, Лаборатории, НоменклатураИсследований = Неопределено) Экспорт
	
	// Вызов функции из документа забора анализов.
	Если Лаборатории <> Неопределено И НоменклатураИсследований <> Неопределено Тогда
		// Получаем внешние лаборатории, для которых используется интеграция, за исключением полученных из документа.
		АктуальныеЛаборатории = ЛабораторияСервер.ПолучитьАктуальныеЛаборатории(Истина, Ложь, Лаборатории);
		Для Каждого АктуальнаяЛаборатория Из АктуальныеЛаборатории Цикл
			Лаборатории.Добавить(АктуальнаяЛаборатория);
		КонецЦикла;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НоменклатураИсследованийНеЗаполнена", НоменклатураИсследований = Неопределено);
	Запрос.УстановитьПараметр("НоменклатураИсследований", НоменклатураИсследований);
	Запрос.УстановитьПараметр("ЛабораторииНеЗаполнены", Лаборатории = Неопределено);
	Запрос.УстановитьПараметр("Лаборатории", Лаборатории);
	Запрос.УстановитьПараметр("Дата", Дата);
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	НоменклатураАнализов.Лаборатория КАК Лаборатория,
	|	НоменклатураАнализов.Номенклатура КАК Исследование,
	|	НоменклатураАнализов.ID КАК ID,
	|	НЕ НоменклатураАнализов.Исключен КАК Доступно
	|ПОМЕСТИТЬ НоменклатураАнализов
	|ИЗ
	|	РегистрСведений.НоменклатураАнализов КАК НоменклатураАнализов
	|ГДЕ
	|	(&НоменклатураИсследованийНеЗаполнена
	|			ИЛИ НоменклатураАнализов.Номенклатура В (&НоменклатураИсследований))
	|	И (&ЛабораторииНеЗаполнены
	|			ИЛИ НоменклатураАнализов.Лаборатория В (&Лаборатории))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НоменклатураАнализов.Лаборатория КАК Лаборатория,
	|	НоменклатураАнализов.Исследование КАК Исследование,
	|	НоменклатураАнализов.ID КАК ID,
	|	ВЫБОР
	|		КОГДА &Дата >= ПериодыНедоступностиАнализов.Период
	|				И (&Дата < ПериодыНедоступностиАнализов.ДатаОкончания
	|					ИЛИ ПериодыНедоступностиАнализов.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Доступно
	|ПОМЕСТИТЬ ДоступностьИсследованийПоПериодам
	|ИЗ
	|	НоменклатураАнализов КАК НоменклатураАнализов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПериодыНедоступностиАнализов КАК ПериодыНедоступностиАнализов
	|		ПО НоменклатураАнализов.Лаборатория = ПериодыНедоступностиАнализов.Лаборатория
	|			И (ВЫБОР
	|				КОГДА ПериодыНедоступностиАнализов.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|					ТОГДА НоменклатураАнализов.ID = ПериодыНедоступностиАнализов.ID
	|				ИНАЧЕ НоменклатураАнализов.Исследование = ПериодыНедоступностиАнализов.Номенклатура
	|			КОНЕЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоменклатураАнализов.Лаборатория КАК Лаборатория,
	|	НоменклатураАнализов.Исследование КАК Исследование,
	|	НоменклатураАнализов.ID КАК Идентификатор,
	|	ВЫБОР
	|		КОГДА ДоступностьИсследованийПоПериодам.Доступно ЕСТЬ NULL
	|			ТОГДА НоменклатураАнализов.Доступно
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НоменклатураАнализов.Доступно = ИСТИНА
	|						И ДоступностьИсследованийПоПериодам.Доступно = ИСТИНА
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ
	|	КОНЕЦ КАК Доступно
	|ИЗ
	|	НоменклатураАнализов КАК НоменклатураАнализов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДоступностьИсследованийПоПериодам КАК ДоступностьИсследованийПоПериодам
	|		ПО НоменклатураАнализов.Лаборатория = ДоступностьИсследованийПоПериодам.Лаборатория
	|			И НоменклатураАнализов.Исследование = ДоступностьИсследованийПоПериодам.Исследование"
	;
	
	Запрос.Текст = ТекстЗапроса;
	ТаблицаРезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если НоменклатураИсследований = Неопределено Или Лаборатории = Неопределено Тогда
		Возврат ТаблицаРезультатЗапроса;
	Иначе
		// Вызов функции из документа забора анализов.
		Результат = ТаблицаРезультатЗапроса.СкопироватьКолонки();
		
		Отбор = Новый Структура();
		Для Каждого Элемент Из НоменклатураИсследований Цикл
			Для Каждого Лаборатория Из Лаборатории Цикл
				Отбор.Вставить("Лаборатория", Лаборатория);
				Отбор.Вставить("Исследование", Элемент);
				СтрокиТаблицы = ТаблицаРезультатЗапроса.НайтиСтроки(Отбор);
				НоваяСтрока = Результат.Добавить();
				Если СтрокиТаблицы.Количество() <> 0 Тогда
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокиТаблицы[0]);
				Иначе
					НоваяСтрока.Лаборатория = Лаборатория;
					НоваяСтрока.Исследование = Элемент;
					НоваяСтрока.Идентификатор = Неопределено;
					НоваяСтрока.Доступно = Ложь;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		Возврат Результат; 
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти
